zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_R52_COMMON.h
  R52_FLEXCAN5_INT0_8_IRQn     = 137,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN5_INT9_15_IRQn    = 138,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN6_INT0_8_IRQn     = 139,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN6_INT9_15_IRQn    = 140,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN7_INT0_8_IRQn     = 141,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN7_INT9_15_IRQn    = 142,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN8_INT0_8_IRQn     = 143,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN8_INT9_15_IRQn    = 144,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN9_INT0_8_IRQn     = 145,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN9_INT9_15_IRQn    = 146,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN10_INT0_8_IRQn    = 147,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN10_INT9_15_IRQn   = 148,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN11_INT0_8_IRQn    = 149,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN11_INT9_15_IRQn   = 150,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN12_INT0_8_IRQn    = 151,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN12_INT9_15_IRQn   = 152,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN13_INT0_8_IRQn    = 153,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN13_INT9_15_IRQn   = 154,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN14_INT0_8_IRQn    = 155,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN14_INT9_15_IRQn   = 156,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN15_INT0_8_IRQn    = 157,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN15_INT9_15_IRQn   = 158,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXCAN16_INT0_8_IRQn    = 159,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_FLEXCAN16_INT9_15_IRQn   = 160,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_FLEXIO0_INT_IRQn         = 161,              /**< FlexIO */
  R52_FLEXIO1_INT_IRQn         = 162,              /**< FlexIO */
  R52_FLEXRAY_INT0_11_IRQn     = 163,              /**< LRAM Non-Corrected Error/DRAM Non-Corrected Error/LRAM Corrected Error/DRAM Corrected Error/Receive FIFO channel A not empty/Receive FIFO channel B not empty/Wakeup/Combined protocol status and error/Combined CHI error/Combined transmit message buffer/Combined receive message buffer/Global */
  R52_LPI2C0_INT0_1_IRQn       = 164,              /**< Master/Slave */
  R52_LPI2C1_INT0_1_IRQn       = 165,              /**< Master/Slave */
  R52_LPI2C2_INT0_1_IRQn       = 166,              /**< Master/Slave */
  R52_LPI2C3_INT0_1_IRQn       = 167,              /**< Master/Slave */
  R52_LPSPI0_INT_IRQn          = 168,              /**< Transmit and receive data and errors */
  R52_LPSPI1_INT_IRQn          = 169,              /**< Transmit and receive data and errors */
  R52_LPSPI2_INT_IRQn          = 170,              /**< Transmit and receive data and errors */
  R52_LPSPI3_INT_IRQn          = 171,              /**< Transmit and receive data and errors */
  R52_LPSPI4_INT_IRQn          = 172,              /**< Transmit and receive data and errors */
  R52_LPSPI5_INT_IRQn          = 173,              /**< Transmit and receive data and errors */
  R52_LPSPI6_INT_IRQn          = 174,              /**< Transmit and receive data and errors */
  R52_LPSPI7_INT_IRQn          = 175,              /**< Transmit and receive data and errors */
  R52_LPUART0_INT0_1_IRQn      = 176,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART1_INT0_1_IRQn      = 177,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART2_INT0_1_IRQn      = 178,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART3_INT0_1_IRQn      = 179,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART4_INT0_1_IRQn      = 180,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART5_INT0_1_IRQn      = 181,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART6_INT0_1_IRQn      = 182,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART7_INT0_1_IRQn      = 183,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART8_INT0_1_IRQn      = 184,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART9_INT0_1_IRQn      = 185,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART10_INT0_1_IRQn     = 186,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART11_INT0_1_IRQn     = 187,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART12_INT0_1_IRQn     = 188,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART13_INT0_1_IRQn     = 189,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART14_INT0_1_IRQn     = 190,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART15_INT0_1_IRQn     = 191,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART16_INT0_1_IRQn     = 192,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART17_INT0_1_IRQn     = 193,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART18_INT0_1_IRQn     = 194,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART19_INT0_1_IRQn     = 195,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART20_INT0_1_IRQn     = 196,              /**< Transmit data and errors/Receive data and errors */
  R52_LPUART_MSC_INT0_1_IRQn   = 197,              /**< Transmit data and errors/Receive data and errors */
  R52_LFAST_INT0_4_IRQn        = 198,              /**< Transmit/Transmit exception/Receive/Receive exception/ICLC Receive */
  R52_MSGINTR0_INT0_2_IRQn     = 199,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  R52_MSGINTR1_INT0_2_IRQn     = 200,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  R52_MSGINTR2_INT0_2_IRQn     = 201,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  R52_MSGINTR3_INT0_2_IRQn     = 202,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  R52_MSGINTR4_INT0_2_IRQn     = 203,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  R52_MSGINTR5_INT0_2_IRQn     = 204,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  R52_MSGINTR6_INT0_2_IRQn     = 205,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  R52_MSGINTR7_INT0_2_IRQn     = 206,              /**< Message signaled interrupt register 0/Message signaled interrupt register 1/Message signaled interrupt register 2 */
  R52_NETC_IEPRC_INT0_1_IRQn   = 207,              /**< NETC Root Complex PCI 0/NETC Root Complex PCI 1 */
  R52_PSI50_INT0_23_IRQn       = 208,              /**< PSI5 channel 0 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 0 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 0 new message received/PSI5 channel 0 message overwrite/PSI5 channel 0 error/PSI5 channel 0 combined/PSI5 channel 1 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 1 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 1 new message received/PSI5 channel 1 message overwrite/PSI5 channel 1 error/PSI5 channel 1 combined/PSI5 channel 2 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 2 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 2 new message received/PSI5 channel 2 message overwrite/PSI5 channel 2 error/PSI5 channel 2 combined/PSI5 channel 3 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 3 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 3 new message received/PSI5 channel 3 message overwrite/PSI5 channel 3 error/PSI5 channel 3 combined */
  R52_PSI51_INT0_23_IRQn       = 209,              /**< PSI5 channel 0 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 0 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 0 new message received/PSI5 channel 0 message overwrite/PSI5 channel 0 error/PSI5 channel 0 combined/PSI5 channel 1 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 1 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 1 new message received/PSI5 channel 1 message overwrite/PSI5 channel 1 error/PSI5 channel 1 combined/PSI5 channel 2 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 2 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 2 new message received/PSI5 channel 2 message overwrite/PSI5 channel 2 error/PSI5 channel 2 combined/PSI5 channel 3 DMA combined; asserted when data overflow/underflow occurs or dma transfer finished/PSI5 channel 3 combined general; asserted when SENT message arrives/has an error or when the data output register request for new data or are overwritten when not ready to accept new data/PSI5 channel 3 new message received/PSI5 channel 3 message overwrite/PSI5 channel 3 error/PSI5 channel 3 combined */
  R52_PSI5_S0_INT0_18_IRQn     = 210,              /**< PS_SR_IRQ[0]/PS_SR_IRQ[1]/PS_SR_IRQ[2]/PS_SR_IRQ[3]/PS_SR_IRQ[4]/PS_SR_IRQ[5]/PS_SR_IRQ[6]/PS_SR_IRQ[7]/PSI5_E2SSR[1]/PSI5_E2SSR[2]/PSI5_E2SSR[3]/PSI5_E2SSR[4]/PSI5_E2SSR[5]/PSI5_E2SSR[6]/PSI5_E2SSR[7]/PS_GLSR/PSI5_S_0_UART_RX/PSI5_S_0_UART_TX/PSI5_S_0_UART_ERR */
  R52_PSI5_S1_INT0_18_IRQn     = 211,              /**< PS_SR_IRQ[0]/PS_SR_IRQ[1]/PS_SR_IRQ[2]/PS_SR_IRQ[3]/PS_SR_IRQ[4]/PS_SR_IRQ[5]/PS_SR_IRQ[6]/PS_SR_IRQ[7]/PSI5_E2SSR[1]/PSI5_E2SSR[2]/PSI5_E2SSR[3]/PSI5_E2SSR[4]/PSI5_E2SSR[5]/PSI5_E2SSR[6]/PSI5_E2SSR[7]/PS_GLSR/PSI5_S_0_UART_RX/PSI5_S_0_UART_TX/PSI5_S_0_UART_ERR */
  R52_RXLUT_INT_IRQn           = 212,              /**< RXLUT */
  R52_SIPI_INT0_IRQn           = 213,              /**< Read channel 2 */
  R52_SIPI_INT1_6_IRQn         = 214,              /**< Read channel 1/Read channel 3/Read channel 4/Error 1/Error 2/Trigger command */
  R52_SAI0_INT0_1_IRQn         = 216,              /**< Receive/Transmit */
  R52_SAI1_INT0_1_IRQn         = 217,              /**< Receive/Transmit */
  R52_uSDHC_INT_IRQn           = 218,              /**< uSDHC */
  R52_LPE_eDMA3_TCD0_1_INT_IRQn = 220,             /**< DMA transfer complete and error channel 0/DMA transfer complete and error channel 1 */
  R52_LPE_eDMA3_TCD2_3_INT_IRQn = 221,             /**< DMA transfer complete and error channel 2/DMA transfer complete and error channel 3 */
  R52_LPE_eDMA3_TCD4_5_INT_IRQn = 222,             /**< DMA transfer complete and error channel 4/DMA transfer complete and error channel 5 */
  R52_LPE_eDMA3_TCD6_7_INT_IRQn = 223,             /**< DMA transfer complete and error channel 6/DMA transfer complete and error channel 7 */
  R52_LPE_eDMA3_TCD8_9_INT_IRQn = 224,             /**< DMA transfer complete and error channel 8/DMA transfer complete and error channel 9 */
  R52_LPE_eDMA3_TCD10_11_INT_IRQn = 225,           /**< DMA transfer complete and error channel 10/DMA transfer complete and error channel 11 */
  R52_LPE_XRDC_INT_IRQn        = 226,              /**< Transfer error */
  R52_LPE_PMC_INT0_3_IRQn      = 227,              /**< Low-voltage detect on VDD_LVDS < 1.7V (LVDLVDSF flag)/Low-voltage detect VDD_HV_B < 3.0V (LVDB33F flag) and VDD_HV_B < 1.7V (LVDB18F flag)/High-voltage detect > x.xV (HVDxF flags) */
  R52_LPE_MC_RGM_INT_IRQn      = 228,              /**< RGM */
  R52_LPE_SWT_INT_IRQn         = 229,              /**< Initial time-out */
  R52_LPE_SIUL2_INT_IRQn       = 230,              /**< Vector 0 */
  R52_LPE_WKPU_INT0_8_IRQn     = 231,              /**< Group 0/Group 1/Group 2/Group 3/Group 4/Group 5/Group 6/Group 7/Group 8 */
  R52_LPE_WKPU_INT14_IRQn      = 232,              /**< Per core: Active low non-maskable request 5 */
  R52_LPE_WKPU_INT15_IRQn      = 233,              /**< Per core: Active low non-maskable request 6 */
  R52_LPE_WKPU_INT16_IRQn      = 234,              /**< Per core: Active low non-maskable request 7 */
  R52_LPE_CXPI0_INT_IRQn       = 235,              /**< ORed arbitration loss, dominant timeout, wakeup pulse reception */
  R52_LPE_CXPI1_INT_IRQn       = 236,              /**< ORed arbitration loss, dominant timeout, wakeup pulse reception */
  R52_LPE_ERM_INT0_1_IRQn      = 237,              /**< Single-bit correctable event/Multi-bit uncorrectable error event */
  R52_LPE_SARADC_INT0_2_IRQn   = 238,              /**< End of conversion/Error/Analog watchdog */
  R52_LPE_LPCMP0_INT_IRQn      = 239,              /**< Asynchronous */
  R52_LPE_LPCMP1_INT_IRQn      = 240,              /**< Asynchronous */
  R52_LPE_LPCMP2_INT_IRQn      = 241,              /**< Asynchronous */
  R52_LPE_TEMPSENSE_INT0_3_IRQn = 242,             /**< Data ready 0/Comparator threshold 0/Comparator threshold 1/Comparator threshold 2 */
  R52_LPE_BCTU_INT0_4_IRQn     = 243,              /**< ADC conversion triggered/ADC0 conversion data ready/ADC last command of list issued/FIFO1/FIFO2 */
  R52_LPE_FTM_INT0_10_IRQn     = 244,              /**< Channel 0/Channel 1/Channel 2/Channel 3/Channel 4/Channel 5/Channel 6/Channel 7/Fault/Overflow/Reload */
  R52_LPE_LCU_INT_IRQn         = 245,              /**< Logic Cell 0 */
  R52_LPE_PIT_RTI_INT0_3_IRQn  = 246,              /**< Channel 0/Channel 1/Channel 2/Channel 3/Channel 4 (RTI) */
  R52_LPE_RTC_API_INT0_1_IRQn  = 247,              /**< RTC compare and counter overflow/API compare */
  R52_LPE_STM_INT0_3_IRQn      = 248,              /**< Channel 0/Channel 1/Channel 2/Channel 3 */
