zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_R52_COMMON.h
  R52_LPE_FLEXCAN_INT0_8_IRQn  = 249,              /**< CAN bus went to Bus Off state/CAN has completed the Bus Off count process (it has counted 11 recessive bits 128 times) and is ready for bus off recover/Errors detected on the CAN bus/Errors detected on the CAN bus for FD messages in the Fast Bit Rate region/Transmit Error Counter transition from < 96 to >= 96/Receive Error Counter transition from < 96 to >= 96/Correctable error detected in memory read access/Non-correctable error detected in memory read access by host (cpu)/Non-correctable error detected in memory read access by CAN */
  R52_LPE_FLEXCAN_INT9_15_IRQn = 250,              /**< The number of messages stored in FIFO is greater than the FIFO watermarker/At least one message stored in FIFO/An underflow occurs in the FIFO/An overflow occurs in the FIFO/All Message Buffers */
  R52_LPE_LPI2C_INT0_3_IRQn    = 251,              /**< Master/Asynchronous master/Slave/Asynchronous slave */
  R52_LPE_LPSPI0_INT0_1_IRQn   = 252,              /**< Transmit and receive data and errors/Asynchronous */
  R52_LPE_LPSPI1_INT0_1_IRQn   = 253,              /**< Transmit and receive data and errors/Asynchronous */
  R52_LPE_LPUART0_INT0_3_IRQn  = 254,              /**< Transmit data and errors/Asynchronous transmit/Receive data and errors/Asynchronous receive */
  R52_LPE_LPUART1_INT0_3_IRQn  = 255,              /**< Transmit data and errors/Asynchronous transmit/Receive data and errors/Asynchronous receive */
  R52_LPE_LPUART2_INT0_3_IRQn  = 256,              /**< Transmit data and errors/Asynchronous transmit/Receive data and errors/Asynchronous receive */
  R52_CPE_CTI_INT_IRQn         = 257,              /**< Per cluster: Request */
  R52_CPE_XRDC_INT_IRQn        = 258,              /**< Transfer Error */
  R52_CPE_LLC0_INT0_IRQn       = 259,              /**< Number of correctable error is above threshold */
  R52_CPE_LLC0_INT1_IRQn       = 260,              /**< Uncorrectable error */
  R52_CPE_LLC0_INT2_IRQn       = 261,              /**< Module interrupt */
  R52_CPE_LLC0_INT3_IRQn       = 262,              /**< Correctable error */
  R52_CPE_LLC1_INT0_IRQn       = 263,              /**< Number of correctable error is above threshold */
  R52_CPE_LLC1_INT1_IRQn       = 264,              /**< Uncorrectable error */
  R52_CPE_LLC1_INT2_IRQn       = 265,              /**< Module interrupt */
  R52_CPE_LLC1_INT3_IRQn       = 266,              /**< Correctable error */
  R52_CPE_MRU0_INT0_IRQn       = 267,              /**< Per core: Notification channel 0 */
  R52_CPE_MRU0_INT1_IRQn       = 268,              /**< Per core: Notification channel 1 */
  R52_CPE_MRU0_INT2_IRQn       = 269,              /**< Per core: Notification channel 2 */
  R52_CPE_MRU0_INT3_IRQn       = 270,              /**< Per core: Notification channel 3 */
  R52_CPE_MRU0_INT4_IRQn       = 271,              /**< Channel reset */
  R52_CPE_MRU1_INT0_IRQn       = 272,              /**< Per core: Notification channel 0 */
  R52_CPE_MRU1_INT1_IRQn       = 273,              /**< Per core: Notification channel 1 */
  R52_CPE_MRU1_INT2_IRQn       = 274,              /**< Per core: Notification channel 2 */
  R52_CPE_MRU1_INT3_IRQn       = 275,              /**< Per core: Notification channel 3 */
  R52_CPE_MRU1_INT4_IRQn       = 276,              /**< Channel reset */
  R52_CPE_MRU2_INT0_IRQn       = 277,              /**< Per core: Notification channel 0 */
  R52_CPE_MRU2_INT1_IRQn       = 278,              /**< Per core: Notification channel 1 */
  R52_CPE_MRU2_INT2_IRQn       = 279,              /**< Per core: Notification channel 2 */
  R52_CPE_MRU2_INT3_IRQn       = 280,              /**< Per core: Notification channel 3 */
  R52_CPE_MRU2_INT4_IRQn       = 281,              /**< Channel reset */
  R52_CPE_MRU3_INT0_IRQn       = 282,              /**< Per core: Notification channel 0 */
  R52_CPE_MRU3_INT1_IRQn       = 283,              /**< Per core: Notification channel 1 */
  R52_CPE_MRU3_INT2_IRQn       = 284,              /**< Per core: Notification channel 2 */
  R52_CPE_MRU3_INT3_IRQn       = 285,              /**< Per core: Notification channel 3 */
  R52_CPE_MRU3_INT4_IRQn       = 286,              /**< Channel reset */
  R52_CPE_MRU4_INT0_IRQn       = 287,              /**< Per core: Notification channel 0 */
  R52_CPE_MRU4_INT1_IRQn       = 288,              /**< Per core: Notification channel 1 */
  R52_CPE_MRU4_INT2_IRQn       = 289,              /**< Per core: Notification channel 2 */
  R52_CPE_MRU4_INT3_IRQn       = 290,              /**< Per core: Notification channel 3 */
  R52_CPE_MRU4_INT4_IRQn       = 291,              /**< Channel reset */
  R52_CPE_MRU5_INT0_IRQn       = 292,              /**< Per core: Notification channel 0 */
  R52_CPE_MRU5_INT1_IRQn       = 293,              /**< Per core: Notification channel 1 */
  R52_CPE_MRU5_INT2_IRQn       = 294,              /**< Per core: Notification channel 2 */
  R52_CPE_MRU5_INT3_IRQn       = 295,              /**< Per core: Notification channel 3 */
  R52_CPE_MRU5_INT4_IRQn       = 296,              /**< Channel reset */
  R52_CPE_SWT0_INT_IRQn        = 297,              /**< Initial time-out */
  R52_CPE_SWT1_INT_IRQn        = 298,              /**< Initial time-out */
  R52_CPE_SWT2_INT_IRQn        = 299,              /**< Initial time-out */
  R52_CPE_PIT0_INT0_IRQn       = 303,              /**< Channel 0 */
  R52_CPE_PIT0_INT1_IRQn       = 304,              /**< Channel 1 */
  R52_CPE_PIT0_INT2_IRQn       = 305,              /**< Channel 2 */
  R52_CPE_PIT0_INT3_IRQn       = 306,              /**< Channel 3 */
  R52_CPE_PIT1_INT0_IRQn       = 307,              /**< Channel 0 */
  R52_CPE_PIT1_INT1_IRQn       = 308,              /**< Channel 1 */
  R52_CPE_PIT1_INT2_IRQn       = 309,              /**< Channel 2 */
  R52_CPE_PIT1_INT3_IRQn       = 310,              /**< Channel 3 */
  R52_CPE_PIT2_INT0_IRQn       = 311,              /**< Channel 0 */
  R52_CPE_PIT2_INT1_IRQn       = 312,              /**< Channel 1 */
  R52_CPE_PIT2_INT2_IRQn       = 313,              /**< Channel 2 */
  R52_CPE_PIT2_INT3_IRQn       = 314,              /**< Channel 3 */
  R52_CPE_STM0_INT0_IRQn       = 315,              /**< Channel 0 */
  R52_CPE_STM0_INT1_IRQn       = 316,              /**< Channel 1 */
  R52_CPE_STM0_INT2_IRQn       = 317,              /**< Channel 2 */
  R52_CPE_STM0_INT3_IRQn       = 318,              /**< Channel 3 */
  R52_CPE_STM1_INT0_IRQn       = 319,              /**< Channel 0 */
  R52_CPE_STM1_INT1_IRQn       = 320,              /**< Channel 1 */
  R52_CPE_STM1_INT2_IRQn       = 321,              /**< Channel 2 */
  R52_CPE_STM1_INT3_IRQn       = 322,              /**< Channel 3 */
  R52_CPE_STM2_INT0_IRQn       = 323,              /**< Channel 0 */
  R52_CPE_STM2_INT1_IRQn       = 324,              /**< Channel 1 */
  R52_CPE_STM2_INT2_IRQn       = 325,              /**< Channel 2 */
  R52_CPE_STM2_INT3_IRQn       = 326,              /**< Channel 3 */
  R52_CPE_PMC0_INT_IRQn        = 327               /**< Test program has completed */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* #if !defined(S32K566_R52_COMMON_H_) */

